Revit 2024 API
MEPSize.NominalDiameter Property
 Nominal diameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double NominalDiameter { get; }
Visual Basic
Public ReadOnly Property NominalDiameter As Double
	Get
Visual C++
public:
property double NominalDiameter {
	double get ();
}
See Also
MEPSize Class
Autodesk.Revit.DB Namespace